wall_resolved_LES/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

Uinlet          (4 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            // First pulse
            (0       (0 0 0))
            (0.25    (1 0 0))
            (0.5     (2 0 0))
            (0.75    (2.5 0 0))
            (1.2     (4 0 0))
            // plateau
            (2.8     (4 0 0))
            (3.25    (2.5 0 0))
            (3.5     (2 0 0))
            (3.75    (1 0 0))
            (4       (0 0 0))
            (20      (0 0 0))

            // Second pulse
            (20.25   (1 0 0))
            (20.5    (2 0 0))
            (20.75   (2.5 0 0))
            (21.2    (4 0 0))
            // plateau
            (22.8    (4 0 0))
            (23.25   (2.5 0 0))
            (23.5    (2 0 0))
            (23.75   (1 0 0))
            (24      (0 0 0))
            (40      (0 0 0))

            // third pulse
            (40.25   (1 0 0))
            (40.5    (2 0 0))
            (40.75   (2.5 0 0))
            (41.2    (4 0 0))
            // plateau
            (42.8    (4 0 0))
            (43.25   (2.5 0 0))
            (43.5    (2 0 0))
            (43.75   (1 0 0))
            (44      (0 0 0))
            (60      (0 0 0))

            // fourth pulse
            (60.25   (1 0 0))
            (60.5    (2 0 0))
            (60.75   (2.5 0 0))
            (61.2    (4 0 0))
            // plateau
            (62.8    (4 0 0))
            (63.25   (2.5 0 0))
            (63.5    (2 0 0))
            (63.75   (1 0 0))
            (64      (0 0 0))
            (80      (0 0 0))

            // fifth pulse
            (80.25   (1 0 0))
            (80.5    (2 0 0))
            (80.75   (2.5 0 0))
            (81.2    (4 0 0))
            // plateau
            (82.8    (4 0 0))
            (83.25   (2.5 0 0))
            (83.5    (2 0 0))
            (83.75   (1 0 0))
            (84      (0 0 0))
            (100     (0 0 0))

            // sixth pulse
            (100.25  (1 0 0))
            (100.5   (2 0 0))
            (100.75  (2.5 0 0))
            (101.2   (4 0 0))
            // plateau
            (102.8   (4 0 0))
            (103.25  (2.5 0 0))
            (103.5   (2 0 0))
            (103.75  (1 0 0))
            (104     (0 0 0))
            (120     (0 0 0))

            // seventh pulse
            (120.25  (1 0 0))
            (120.5   (2 0 0))
            (120.75  (2.5 0 0))
            (121.2   (4 0 0))
            // plateau
            (122.8   (4 0 0))
            (123.25  (2.5 0 0))
            (123.5   (2 0 0))
            (123.75  (1 0 0))
            (124     (0 0 0))
            (140     (0 0 0))

            // eighth pulse
            (140.25  (1 0 0))
            (140.5   (2 0 0))
            (140.75  (2.5 0 0))
            (141.2   (4 0 0))
            // plateau
            (142.8   (4 0 0))
            (143.25  (2.5 0 0))
            (143.5   (2 0 0))
            (143.75  (1 0 0))
            (144     (0 0 0))
            (160     (0 0 0))

            // ninth pulse
            (160.25  (1 0 0))
            (160.5   (2 0 0))
            (160.75  (2.5 0 0))
            (161.2   (4 0 0))
            // plateau
            (162.8   (4 0 0))
            (163.25  (2.5 0 0))
            (163.5   (2 0 0))
            (163.75  (1 0 0))
            (164     (0 0 0))
            (180     (0 0 0))

            // tenth pulse
            (180.25  (1 0 0))
            (180.5   (2 0 0))
            (180.75  (2.5 0 0))
            (181.2   (4 0 0))
            // plateau
            (182.8   (4 0 0))
            (183.25  (2.5 0 0))
            (183.5   (2 0 0))
            (183.75  (1 0 0))
            (184     (0 0 0))
            (200     (0 0 0))

            // eleventh pulse
            (200.25  (1 0 0))
            (200.5   (2 0 0))
            (200.75  (2.5 0 0))
            (201.2   (4 0 0))
            // plateau
            (202.8   (4 0 0))
            (203.25  (2.5 0 0))
            (203.5   (2 0 0))
            (203.75  (1 0 0))
            (204     (0 0 0))
            (220     (0 0 0))

            // twelfth pulse
            (220.25  (1 0 0))
            (220.5   (2 0 0))
            (220.75  (2.5 0 0))
            (221.2   (4 0 0))
            // plateau
            (222.8   (4 0 0))
            (223.25  (2.5 0 0))
            (223.5   (2 0 0))
            (223.75  (1 0 0))
            (224     (0 0 0))
            (240     (0 0 0))

            // thirteenth pulse
            (240.25  (1 0 0))
            (240.5   (2 0 0))
            (240.75  (2.5 0 0))
            (241.2   (4 0 0))
            // plateau
            (242.8   (4 0 0))
            (243.25  (2.5 0 0))
            (243.5   (2 0 0))
            (243.75  (1 0 0))
            (244     (0 0 0))
            (260     (0 0 0))

            // fourteenth pulse
            (260.25  (1 0 0))
            (260.5   (2 0 0))
            (260.75  (2.5 0 0))
            (261.2   (4 0 0))
            // plateau
            (262.8   (4 0 0))
            (263.25  (2.5 0 0))
            (263.5   (2 0 0))
            (263.75  (1 0 0))
            (264     (0 0 0))
            (280     (0 0 0))

            // fifteenth pulse
            (280.25  (1 0 0))
            (280.5   (2 0 0))
            (280.75  (2.5 0 0))
            (281.2   (4 0 0))
            // plateau
            (282.8   (4 0 0))
            (283.25  (2.5 0 0))
            (283.5   (2 0 0))
            (283.75  (1 0 0))
            (284     (0 0 0))
            (300     (0 0 0))

            // sixteenth pulse
            (300.25  (1 0 0))
            (300.5   (2 0 0))
            (300.75  (2.5 0 0))
            (301.2   (4 0 0))
            // plateau
            (302.8   (4 0 0))
            (303.25  (2.5 0 0))
            (303.5   (2 0 0))
            (303.75  (1 0 0))
            (304     (0 0 0))
            (320     (0 0 0))

            // seventeenth pulse
            (320.25  (1 0 0))
            (320.5   (2 0 0))
            (320.75  (2.5 0 0))
            (321.2   (4 0 0))
            // plateau
            (322.8   (4 0 0))
            (323.25  (2.5 0 0))
            (323.5   (2 0 0))
            (323.75  (1 0 0))
            (324     (0 0 0))
            (340     (0 0 0))

            // eighteenth pulse
            (340.25  (1 0 0))
            (340.5   (2 0 0))
            (340.75  (2.5 0 0))
            (341.2   (4 0 0))
            // plateau
            (342.8   (4 0 0))
            (343.25  (2.5 0 0))
            (343.5   (2 0 0))
            (343.75  (1 0 0))
            (344     (0 0 0))
            (360     (0 0 0))

            // nineteenth pulse
            (360.25  (1 0 0))
            (360.5   (2 0 0))
            (360.75  (2.5 0 0))
            (361.2   (4 0 0))
            // plateau
            (362.8   (4 0 0))
            (363.25  (2.5 0 0))
            (363.5   (2 0 0))
            (363.75  (1 0 0))
            (364     (0 0 0))
            (380     (0 0 0))

            // twentieth pulse
            (380.25  (1 0 0))
            (380.5   (2 0 0))
            (380.75  (2.5 0 0))
            (381.2   (4 0 0))
            // plateau
            (382.8   (4 0 0))
            (383.25  (2.5 0 0))
            (383.5   (2 0 0))
            (383.75  (1 0 0))
            (384     (0 0 0))
            (400     (0 0 0))

            // twenty-first pulse
            (400.25  (1 0 0))
            (400.5   (2 0 0))
            (400.75  (2.5 0 0))
            (401.2   (4 0 0))
            // plateau
            (402.8   (4 0 0))
            (403.25  (2.5 0 0))
            (403.5   (2 0 0))
            (403.75  (1 0 0))
            (404     (0 0 0))
            (420     (0 0 0))

            // twenty-second pulse
            (420.25  (1 0 0))
            (420.5   (2 0 0))
            (420.75  (2.5 0 0))
            (421.2   (4 0 0))
            // plateau
            (422.8   (4 0 0))
            (423.25  (2.5 0 0))
            (423.5   (2 0 0))
            (423.75  (1 0 0))
            (424     (0 0 0))
            (440     (0 0 0))

            // twenty-third pulse
            (440.25  (1 0 0))
            (440.5   (2 0 0))
            (440.75  (2.5 0 0))
            (441.2   (4 0 0))
            // plateau
            (442.8   (4 0 0))
            (443.25  (2.5 0 0))
            (443.5   (2 0 0))
            (443.75  (1 0 0))
            (444     (0 0 0))
            (460     (0 0 0))

            // twenty-fourth pulse
            (460.25  (1 0 0))
            (460.5   (2 0 0))
            (460.75  (2.5 0 0))
            (461.2   (4 0 0))
            // plateau
            (462.8   (4 0 0))
            (463.25  (2.5 0 0))
            (463.5   (2 0 0))
            (463.75  (1 0 0))
            (464     (0 0 0))
            (480     (0 0 0))

            // twenty-fifth pulse
            (480.25  (1 0 0))
            (480.5   (2 0 0))
            (480.75  (2.5 0 0))
            (481.2   (4 0 0))
            // plateau
            (482.8   (4 0 0))
            (483.25  (2.5 0 0))
            (483.5   (2 0 0))
            (483.75  (1 0 0))
            (484     (0 0 0))
            (500     (0 0 0))

            // twenty-sixth pulse
            (500.25  (1 0 0))
            (500.5   (2 0 0))
            (500.75  (2.5 0 0))
            (501.2   (4 0 0))
            // plateau
            (502.8   (4 0 0))
            (503.25  (2.5 0 0))
            (503.5   (2 0 0))
            (503.75  (1 0 0))
            (504     (0 0 0))
            (520     (0 0 0))

            // twenty-seventh pulse
            (520.25  (1 0 0))
            (520.5   (2 0 0))
            (520.75  (2.5 0 0))
            (521.2   (4 0 0))
            // plateau
            (522.8   (4 0 0))
            (523.25  (2.5 0 0))
            (523.5   (2 0 0))
            (523.75  (1 0 0))
            (524     (0 0 0))
            (540     (0 0 0))

            // twenty-eighth pulse
            (540.25  (1 0 0))
            (540.5   (2 0 0))
            (540.75  (2.5 0 0))
            (541.2   (4 0 0))
            // plateau
            (542.8   (4 0 0))
            (543.25  (2.5 0 0))
            (543.5   (2 0 0))
            (543.75  (1 0 0))
            (544     (0 0 0))
            (560     (0 0 0))

            // twenty-ninth pulse
            (560.25  (1 0 0))
            (560.5   (2 0 0))
            (560.75  (2.5 0 0))
            (561.2   (4 0 0))
            // plateau
            (562.8   (4 0 0))
            (563.25  (2.5 0 0))
            (563.5   (2 0 0))
            (563.75  (1 0 0))
            (564     (0 0 0))
            (580     (0 0 0))

            // thirtieth pulse
            (580.25  (1 0 0))
            (580.5   (2 0 0))
            (580.75  (2.5 0 0))
            (581.2   (4 0 0))
            // plateau
            (582.8   (4 0 0))
            (583.25  (2.5 0 0))
            (583.5   (2 0 0))
            (583.75  (1 0 0))
            (584     (0 0 0))
            (600     (0 0 0))
        );
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    WERFL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    buildings
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //