wall_resolved_LES/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.228;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    buildings
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    WERFL
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //