wall_resolved_LES/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
        type            nutkWallFunction;
        z0              uniform 0.001;
        value           uniform 0.001;
    }

    buildings
    {
        type            nutkWallFunction;
        z0              uniform 0.001;
        value           uniform 0.001;
    }

    WERFL
    {
        type            nutkWallFunction;
        z0              uniform 0.001;
        value           uniform 0.001;
    }

    block_front
    {
        type            nutkWallFunction;
        z0              uniform 0.001;
        value           uniform 0.001;
    }

    frontAndBack
    {
        type            nutkWallFunction;
        z0              uniform 0.001;
        value           uniform 0.001;
    }
}

// ************************************************************************* //