wall_resolved_LES/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType  LES;

LES
{
    model           WALE;

    turbulence      on;

    printCoeffs     on;

    delta           cubeRootVol;

    WALECoeffs
    {
        Ck          0.094;
        Ce          1.048;
        Cw          0.325;
    }

    dynamicKEqnCoeffs
    {
        filter      simple;
    }

    cubeRootVolCoeffs
    {
        deltaCoeff  1;
    }

    PrandtlCoeffs
    {
        delta       cubeRootVol;

        cubeRootVolCoeffs
        {
            deltaCoeff  1;
        }

        smoothCoeffs
        {
            delta       cubeRootVol;

            cubeRootVolCoeffs
            {
                deltaCoeff  1;
            }

            maxDeltaRatio   1.1;
        }

        Cdelta      0.158;
    }

    vanDriestCoeffs
    {
        delta       cubeRootVol;

        cubeRootVolCoeffs
        {
            deltaCoeff  1;
        }

        smoothCoeffs
        {
            delta       cubeRootVol;

            cubeRootVolCoeffs
            {
                deltaCoeff  1;
            }

            maxDeltaRatio   1.1;
        }

        Aplus       26;
        Cdelta      0.158;
    }

    smoothCoeffs
    {
        delta       cubeRootVol;

        cubeRootVolCoeffs
        {
            deltaCoeff  1;
        }

        maxDeltaRatio   1.1;
    }
}

// ************************************************************************* //