wall_resolved_LES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

backgroundMesh
{
    xMin     -2;
    xMax     20;
    yMin     0;
    yMax     3;
    zMin     0;
    zMax     6;

    xCells   220;
    yCells   60;
    zCells   120;
}

convertToMeters 1;

vertices
(
    ($backgroundMesh/xMin $backgroundMesh/yMin $backgroundMesh/zMin)
    ($backgroundMesh/xMax $backgroundMesh/yMin $backgroundMesh/zMin)
    ($backgroundMesh/xMax $backgroundMesh/yMax $backgroundMesh/zMin)
    ($backgroundMesh/xMin $backgroundMesh/yMax $backgroundMesh/zMin)

    ($backgroundMesh/xMin $backgroundMesh/yMin $backgroundMesh/zMax)
    ($backgroundMesh/xMax $backgroundMesh/yMin $backgroundMesh/zMax)
    ($backgroundMesh/xMax $backgroundMesh/yMax $backgroundMesh/zMax)
    ($backgroundMesh/xMin $backgroundMesh/yMax $backgroundMesh/zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $backgroundMesh/xCells
        $backgroundMesh/yCells
        $backgroundMesh/zCells
    )
    simpleGrading (1.2 1.15 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (3 2 6 7)
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
