wall_resolved_LES/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     foamRun;

solver          incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   20000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
      

         yPlus1
{
    type        yPlus;
    libs        ("libfieldFunctionObjects.so");
    writeControl   timeStep;
    writeInterval  20000; 
}

// editable 

// Center is at (16,3)

    Inlet_vel
    {
        
                type            probes;
        libs            ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  20;  //deltaT*writeInterval=0.02, this should make the probes to write U at every time step

        fields
        (
            U p
        );
        
        
        
        probeLocations //locations to be probed
        (
 
(	-1	1.5	3	)	//inlet velocity (plot to see the sine wave)
            
        );

        
    };


Roof_WERFL_fixed
    {
        
                type            probes;
        libs            ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  20;  //deltaT*writeInterval=0.02, this should make the probes to write U at every time step

        fields
        (
            U p
        );
        
        
	probeLocations //locations to be probed
        (
 
(	13.991315	0.202575	3.112875	)
(	13.991315	0.202575	2.887125	)
(	14.011865	0.202515	3.317945	)
(	14.011865	0.202515	3.279845	)
(	14.011865	0.202515	3.241745	)
(	14.011865	0.202515	3.203645	)
(	14.011865	0.202515	3.165545	)
(	14.011865	0.202515	3.051245	)
(	14.011865	0.202515	3.013145	)
(	14.011865	0.202515	2.975005	)
(	14.011865	0.202515	2.936905	)
(	14.011865	0.202515	2.822605	)
(	14.011865	0.202515	2.784505	)
(	14.011865	0.202515	2.746405	)
(	14.011865	0.202515	2.708305	)
(	14.011865	0.202515	2.670205	)
(	13.988135	0.202515	3.317945	)
(	13.988135	0.202515	3.279845	)
(	13.988135	0.202515	3.241745	)
(	13.988135	0.202515	3.203645	)
(	13.988135	0.202515	3.165545	)
(	13.988135	0.202515	3.051245	)
(	13.988135	0.202515	3.013145	)
(	13.988135	0.202515	2.975005	)
(	13.988135	0.202515	2.936905	)
(	13.988135	0.202515	2.822605	)
(	13.988135	0.202515	2.784505	)
(	13.988135	0.202515	2.746405	)
(	13.988135	0.202515	2.708305	)
(	13.988135	0.202515	2.670205	)
(	13.950225	0.201785	3.112875	)
(	13.950225	0.201785	2.887125	)
(	14.049955	0.201715	3.317945	)
(	14.049955	0.201715	3.279845	)
(	14.049955	0.201715	3.241745	)
(	14.049955	0.201715	3.203645	)
(	14.049955	0.201715	3.165545	)
(	14.049955	0.201715	3.051245	)
(	14.049955	0.201715	3.013145	)
(	14.049955	0.201715	2.975005	)
(	14.049955	0.201715	2.936905	)
(	14.049955	0.201715	2.822605	)
(	14.049955	0.201715	2.784505	)
(	14.049955	0.201715	2.746405	)
(	14.049955	0.201715	2.708305	)
(	14.049955	0.201715	2.670205	)
(	13.950045	0.201715	3.317945	)
(	13.950045	0.201715	3.279845	)
(	13.950045	0.201715	3.241745	)
(	13.950045	0.201715	3.203645	)
(	13.950045	0.201715	3.165545	)
(	13.950045	0.201715	3.051245	)
(	13.950045	0.201715	3.013145	)
(	13.950045	0.201715	2.975005	)
(	13.950045	0.201715	2.936905	)
(	13.950045	0.201715	2.822605	)
(	13.950045	0.201715	2.784505	)
(	13.950045	0.201715	2.746405	)
(	13.950045	0.201715	2.708305	)
(	13.950045	0.201715	2.670205	)
(	14.079215	0.201105	3.336995	)
(	14.079215	0.201105	3.317945	)
(	14.079215	0.201105	3.298895	)
(	14.079215	0.201105	3.279845	)
(	14.079215	0.201105	3.260795	)
(	14.079215	0.201105	3.241745	)
(	14.079215	0.201105	3.222795	)
(	14.079215	0.201105	3.203645	)
(	14.079215	0.201105	3.184595	)
(	14.079215	0.201105	3.165545	)
(	14.079215	0.201105	3.146495	)
(	14.079215	0.201105	3.127445	)
(	14.079215	0.201105	3.051245	)
(	14.079215	0.201105	3.013145	)
(	14.079215	0.201105	2.975005	)
(	14.079215	0.201105	2.936905	)
(	14.079215	0.201105	2.898805	)
(	14.079215	0.201105	2.860705	)
(	14.079215	0.201105	2.822605	)
(	14.079215	0.201105	2.784505	)
(	14.079215	0.201105	2.746405	)
(	14.079215	0.201105	2.708305	)
(	14.079215	0.201105	2.670205	)
(	13.920785	0.201105	3.336995	)
(	13.920785	0.201105	3.317945	)
(	13.920785	0.201105	3.298895	)
(	13.920785	0.201105	3.279845	)
(	13.920785	0.201105	3.260795	)
(	13.920785	0.201105	3.241745	)
(	13.920785	0.201105	3.222795	)
(	13.920785	0.201105	3.203645	)
(	13.920785	0.201105	3.184595	)
(	13.920785	0.201105	3.165545	)
(	13.920785	0.201105	3.127445	)
(	13.920785	0.201105	3.146495	)
(	13.920785	0.201105	3.051245	)
(	13.920785	0.201105	3.013145	)
(	13.920785	0.201105	2.975005	)
(	13.920785	0.201105	2.936905	)
(	13.920785	0.201105	2.898805	)
...
(	13.781805	0.198215	2.887125	)
(	14.008555	0.202575	3.112875	)  //these 4 probes weren't working. So I changed the height.
(	14.008555	0.202575	2.887125	)
(	14.046645	0.201785	3.112875	)
(	14.046645	0.201785	2.887125	)

            
        );



   Roof_WERFL
    {
        
                type            probes;
        libs            ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  20;  //deltaT*writeInterval=0.02, this should make the probes to write U at every time step

        fields
        (
            U p
        );
        
        
        
        probeLocations //locations to be probed
        (
 
(	13.991315	0.202575	2.887125	)
(	13.991315	0.202575	3.112875	)
(	14.011865	0.202515	2.682055	)
(	14.011865	0.202515	2.720155	)
(	14.011865	0.202515	2.758255	)
(	14.011865	0.202515	2.796355	)
(	14.011865	0.202515	2.834455	)
(	14.011865	0.202515	2.948755	)
(	14.011865	0.202515	2.986855	)
(	14.011865	0.202515	3.024995	)
(	14.011865	0.202515	3.063095	)
(	14.011865	0.202515	3.177395	)
(	14.011865	0.202515	3.215495	)
(	14.011865	0.202515	3.253595	)
(	14.011865	0.202515	3.291695	)
(	14.011865	0.202515	3.329795	)
(	13.988135	0.202515	2.682055	)
(	13.988135	0.202515	2.720155	)
(	13.988135	0.202515	2.758255	)
(	13.988135	0.202515	2.796355	)
(	13.988135	0.202515	2.834455	)
(	13.988135	0.202515	2.948755	)
(	13.988135	0.202515	2.986855	)
(	13.988135	0.202515	3.024995	)
(	13.988135	0.202515	3.063095	)
(	13.988135	0.202515	3.177395	)
(	13.988135	0.202515	3.215495	)
(	13.988135	0.202515	3.253595	)
(	13.988135	0.202515	3.291695	)
(	13.988135	0.202515	3.329795	)
(	13.950225	0.201785	2.887125	)
(	13.950225	0.201785	3.112875	)
(	14.049955	0.201715	2.682055	)
(	14.049955	0.201715	2.720155	)
(	14.049955	0.201715	2.758255	)
(	14.049955	0.201715	2.796355	)
(	14.049955	0.201715	2.834455	)
(	14.049955	0.201715	2.948755	)
(	14.049955	0.201715	2.986855	)
(	14.049955	0.201715	3.024995	)
(	14.049955	0.201715	3.063095	)
(	14.049955	0.201715	3.177395	)
(	14.049955	0.201715	3.215495	)
(	14.049955	0.201715	3.253595	)
(	14.049955	0.201715	3.291695	)
(	14.049955	0.201715	3.329795	)
(	13.950045	0.201715	2.682055	)
(	13.950045	0.201715	2.720155	)
(	13.950045	0.201715	2.758255	)
(	13.950045	0.201715	2.796355	)
(	13.950045	0.201715	2.834455	)
(	13.950045	0.201715	2.948755	)
(	13.950045	0.201715	2.986855	)
(	13.950045	0.201715	3.024995	)
(	13.950045	0.201715	3.063095	)
(	13.950045	0.201715	3.177395	)
(	13.950045	0.201715	3.215495	)
(	13.950045	0.201715	3.253595	)
(	13.950045	0.201715	3.291695	)
(	13.950045	0.201715	3.329795	)
(	14.079215	0.201105	2.663005	)
(	14.079215	0.201105	2.682055	)
(	14.079215	0.201105	2.701105	)
(	14.079215	0.201105	2.720155	)
(	14.079215	0.201105	2.739205	)
(	14.079215	0.201105	2.758255	)
(	14.079215	0.201105	2.777205	)
(	14.079215	0.201105	2.796355	)
(	14.079215	0.201105	2.815405	)
(	14.079215	0.201105	2.834455	)
(	14.079215	0.201105	2.853505	)
(	14.079215	0.201105	2.872555	)
(	14.079215	0.201105	2.948755	)
(	14.079215	0.201105	2.986855	)
(	14.079215	0.201105	3.024995	)
(	14.079215	0.201105	3.063095	)
(	14.079215	0.201105	3.101195	)
(	14.079215	0.201105	3.139295	)
(	14.079215	0.201105	3.177395	)
(	14.079215	0.201105	3.215495	)
(	14.079215	0.201105	3.253595	)
(	14.079215	0.201105	3.291695	)
(	14.079215	0.201105	3.329795	)
(	13.920785	0.201105	2.663005	)
(	13.920785	0.201105	2.682055	)
(	13.920785	0.201105	2.701105	)
(	13.920785	0.201105	2.720155	)
(	13.920785	0.201105	2.739205	)
(	13.920785	0.201105	2.758255	)
(	13.920785	0.201105	2.777205	)
(	13.920785	0.201105	2.796355	)
(	13.920785	0.201105	2.815405	)
(	13.920785	0.201105	2.834455	)
(	13.920785	0.201105	2.872555	)
(	13.920785	0.201105	2.853505	)
(	13.920785	0.201105	2.948755	)
(	13.920785	0.201105	2.986855	)
(	13.920785	0.201105	3.024995	)
(	13.920785	0.201105	3.063095	)
(	13.920785	0.201105	3.101195	)
...
(	13.781805	0.198215	3.112875	)
(	14.008555	0.202575	2.887125	)  //these 4 probes weren't working. So I changed the height.
(	14.008555	0.202575	3.112875	)
(	14.046645	0.201785	2.887125	)
(	14.046645	0.201785	3.112875	)

            
        );

        
    };


  Mid_height_WERFL
    {
        
                type            probes;
        libs            ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  20;  //deltaT*writeInterval=0.02, this should make the probes to write U at every time step

        fields
        (
            U p
        );
        
        
        
        probeLocations //locations to be probed
        (
 
(	14.176915	0.127015	2.653485	)
(	14.100715	0.127015	2.653485	)
(	14.024515	0.127015	2.653485	)
(	13.975485	0.127015	2.653485	)
(	13.899285	0.127015	2.653485	)
(	13.823085	0.127015	2.653485	)
(	13.772285	0.127015	2.704285	)
(	13.772285	0.127015	2.780485	)
(	13.772285	0.127015	2.856685	)
(	13.772285	0.127015	2.932885	)
(	13.772285	0.127015	3.067115	)
(	13.772285	0.127015	3.143315	)
(	13.772285	0.127015	3.219515	)
(	13.772285	0.127015	3.295715	)
(	13.823085	0.127015	3.346515	)
(	13.899285	0.127015	3.346515	)
(	13.975485	0.127015	3.346515	)
(	14.024515	0.127015	3.346515	)
(	14.100715	0.127015	3.346515	)
(	14.176915	0.127015	3.346515	)
(	14.227715	0.127015	3.295715	)
(	14.227715	0.127015	3.219515	)
(	14.227715	0.127015	3.143315	)
(	14.227715	0.127015	3.067115	)
(	14.227715	0.127015	2.932885	)
(	14.227715	0.127015	2.856685	)
(	14.227715	0.127015	2.780485	)
(	14.227715	0.127015	2.704285	)

            
        );

        
    };
        

Bottom_level_WERFL

    {
        
                type            probes;
        libs            ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  20;  //deltaT*writeInterval=0.02, this should make the probes to write U at every time step

        fields
        (
            U p
        );
        
        
        
        probeLocations //locations to be probed
        (

 (	14.176915	0.050815	2.653485	)
(	14.100715	0.050815	2.653485	)
(	14.024515	0.050815	2.653485	)
(	13.975485	0.050815	2.653485	)
(	13.899285	0.050815	2.653485	)
(	13.823085	0.050815	2.653485	)
(	13.772285	0.050815	2.704285	)
(	13.772285	0.050815	2.780485	)
(	13.772285	0.050815	2.856685	)
(	13.772285	0.050815	2.932885	)
(	13.772285	0.050815	3.067115	)
(	13.772285	0.050815	3.143315	)
(	13.772285	0.050815	3.219515	)
(	13.772285	0.050815	3.295715	)
(	13.823085	0.050815	3.346515	)
(	13.899285	0.050815	3.346515	)
(	13.975485	0.050815	3.346515	)
(	14.024515	0.050815	3.346515	)
(	14.100715	0.050815	3.346515	)
(	14.176915	0.050815	3.346515	)
(	14.227715	0.050815	3.295715	)
(	14.227715	0.050815	3.219515	)
(	14.227715	0.050815	3.143315	)
(	14.227715	0.050815	3.067115	)
(	14.227715	0.050815	2.932885	)
(	14.227715	0.050815	2.856685	)
(	14.227715	0.050815	2.780485	)
(	14.227715	0.050815	2.704285	)


            
        );

        
    };


Vel_z_p75_m

    {
        
                type            probes;
        libs            ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  20;  //deltaT*writeInterval=0.02, this should make the probes to write U at every time step

        fields
        (
            U p
        );
        
        
        
        probeLocations //locations to be probed
        (

 (	10.5	0.75	0.25	)
(	10.75	0.75	0.25	)
(	11	0.75	0.25	)
(	11.25	0.75	0.25	)
(	11.5	0.75	0.25	)
(	11.75	0.75	0.25	)
(	12	0.75	0.25	)
(	12.25	0.75	0.25	)
(	12.5	0.75	0.25	)
(	12.75	0.75	0.25	)
(	13	0.75	0.25	)
(	13.25	0.75	0.25	)
(	13.5	0.75	0.25	)
(	13.75	0.75	0.25	)
(	14	0.75	0.25	)
(	14.25	0.75	0.25	)
(	14.5	0.75	0.25	)
(	14.75	0.75	0.25	)
(	15	0.75	0.25	)
(	15.25	0.75	0.25	)
(	15.5	0.75	0.25	)
(	15.75	0.75	0.25	)
(	16	0.75	0.25	)
(	16.25	0.75	0.25	)
(	16.5	0.75	0.25	)
(	16.75	0.75	0.25	)
(	17	0.75	0.25	)
(	17.25	0.75	0.25	)
(	17.5	0.75	0.25	)
(	17.75	0.75	0.25	)
(	18	0.75	0.25	)
(	18.25	0.75	0.25	)
(	18.5	0.75	0.25	)
(	18.75	0.75	0.25	)
(	19	0.75	0.25	)
(	19.25	0.75	0.25	)
(	19.5	0.75	0.25	)
(	10.5	0.75	0.5	)
(	10.75	0.75	0.5	)
(	11	0.75	0.5	)
(	11.25	0.75	0.5	)
(	11.5	0.75	0.5	)
(	11.75	0.75	0.5	)
(	12	0.75	0.5	)
(	12.25	0.75	0.5	)
(	12.5	0.75	0.5	)
(	12.75	0.75	0.5	)
(	13	0.75	0.5	)
(	13.25	0.75	0.5	)
(	13.5	0.75	0.5	)
(	13.75	0.75	0.5	)
(	14	0.75	0.5	)
(	14.25	0.75	0.5	)
(	14.5	0.75	0.5	)
(	14.75	0.75	0.5	)
(	15	0.75	0.5	)
(	15.25	0.75	0.5	)
(	15.5	0.75	0.5	)
(	15.75	0.75	0.5	)
(	16	0.75	0.5	)
(	16.25	0.75	0.5	)
(	16.5	0.75	0.5	)
(	16.75	0.75	0.5	)
(	17	0.75	0.5	)
(	17.25	0.75	0.5	)
(	17.5	0.75	0.5	)
(	17.75	0.75	0.5	)
(	18	0.75	0.5	)
(	18.25	0.75	0.5	)
(	18.5	0.75	0.5	)
(	18.75	0.75	0.5	)
(	19	0.75	0.5	)
(	19.25	0.75	0.5	)
(	19.5	0.75	0.5	)
(	10.5	0.75	0.75	)
(	10.75	0.75	0.75	)
(	11	0.75	0.75	)
(	11.25	0.75	0.75	)
(	11.5	0.75	0.75	)
(	11.75	0.75	0.75	)
(	12	0.75	0.75	)
(	12.25	0.75	0.75	)
(	12.5	0.75	0.75	)
(	12.75	0.75	0.75	)
(	13	0.75	0.75	)
(	13.25	0.75	0.75	)
(	13.5	0.75	0.75	)
(	13.75	0.75	0.75	)
(	14	0.75	0.75	)
(	14.25	0.75	0.75	)
(	14.5	0.75	0.75	)
(	14.75	0.75	0.75	)
(	15	0.75	0.75	)
(	15.25	0.75	0.75	)
(	15.5	0.75	0.75	)
(	15.75	0.75	0.75	)
(	16	0.75	0.75	)
(	16.25	0.75	0.75	)
(	16.5	0.75	0.75	)
(	16.75	0.75	0.75	)
...
(	19.5	0.75	5.75	)


            
        );

        
    };
        


Vel_z_1p5_m

    {
        
                type            probes;
        libs            ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  20;  //deltaT*writeInterval=0.02, this should make the probes to write U at every time step

        fields
        (
            U p
        );
        
        
        
        probeLocations //locations to be probed
        (

 
(	10.5	1.5	0.25	)
(	10.75	1.5	0.25	)
(	11	1.5	0.25	)
(	11.25	1.5	0.25	)
(	11.5	1.5	0.25	)
(	11.75	1.5	0.25	)
(	12	1.5	0.25	)
(	12.25	1.5	0.25	)
(	12.5	1.5	0.25	)
(	12.75	1.5	0.25	)
(	13	1.5	0.25	)
(	13.25	1.5	0.25	)
(	13.5	1.5	0.25	)
(	13.75	1.5	0.25	)
(	14	1.5	0.25	)
(	14.25	1.5	0.25	)
(	14.5	1.5	0.25	)
(	14.75	1.5	0.25	)
(	15	1.5	0.25	)
(	15.25	1.5	0.25	)
(	15.5	1.5	0.25	)
(	15.75	1.5	0.25	)
(	16	1.5	0.25	)
(	16.25	1.5	0.25	)
(	16.5	1.5	0.25	)
(	16.75	1.5	0.25	)
(	17	1.5	0.25	)
(	17.25	1.5	0.25	)
(	17.5	1.5	0.25	)
(	17.75	1.5	0.25	)
(	18	1.5	0.25	)
(	18.25	1.5	0.25	)
(	18.5	1.5	0.25	)
(	18.75	1.5	0.25	)
(	19	1.5	0.25	)
(	19.25	1.5	0.25	)
(	19.5	1.5	0.25	)
(	10.5	1.5	0.5	)
(	10.75	1.5	0.5	)
(	11	1.5	0.5	)
(	11.25	1.5	0.5	)
(	11.5	1.5	0.5	)
(	11.75	1.5	0.5	)
(	12	1.5	0.5	)
(	12.25	1.5	0.5	)
(	12.5	1.5	0.5	)
(	12.75	1.5	0.5	)
(	13	1.5	0.5	)
(	13.25	1.5	0.5	)
(	13.5	1.5	0.5	)
(	13.75	1.5	0.5	)
(	14	1.5	0.5	)
(	14.25	1.5	0.5	)
(	14.5	1.5	0.5	)
(	14.75	1.5	0.5	)
(	15	1.5	0.5	)
(	15.25	1.5	0.5	)
(	15.5	1.5	0.5	)
(	15.75	1.5	0.5	)
(	16	1.5	0.5	)
(	16.25	1.5	0.5	)
(	16.5	1.5	0.5	)
(	16.75	1.5	0.5	)
(	17	1.5	0.5	)
(	17.25	1.5	0.5	)
(	17.5	1.5	0.5	)
(	17.75	1.5	0.5	)
(	18	1.5	0.5	)
(	18.25	1.5	0.5	)
(	18.5	1.5	0.5	)
(	18.75	1.5	0.5	)
(	19	1.5	0.5	)
(	19.25	1.5	0.5	)
(	19.5	1.5	0.5	)
(	10.5	1.5	0.75	)
(	10.75	1.5	0.75	)
(	11	1.5	0.75	)
(	11.25	1.5	0.75	)
(	11.5	1.5	0.75	)
(	11.75	1.5	0.75	)
(	12	1.5	0.75	)
(	12.25	1.5	0.75	)
(	12.5	1.5	0.75	)
(	12.75	1.5	0.75	)
(	13	1.5	0.75	)
(	13.25	1.5	0.75	)
(	13.5	1.5	0.75	)
(	13.75	1.5	0.75	)
(	14	1.5	0.75	)
(	14.25	1.5	0.75	)
(	14.5	1.5	0.75	)
(	14.75	1.5	0.75	)
(	15	1.5	0.75	)
(	15.25	1.5	0.75	)
(	15.5	1.5	0.75	)
(	15.75	1.5	0.75	)
(	16	1.5	0.75	)
(	16.25	1.5	0.75	)
(	16.5	1.5	0.75	)
(	16.75	1.5	0.75	)
...
(	19.5	1.5	5.75	)

            
        );

        
    };
        



    };

     /////

    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        
        
        
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    };



    surfaceSampling
    {
        // Sample near-wall velocity

        type surfaces;

        // Where to load it from (if not already in solver)
        libs            ("libsampling.so");
        writeControl    writeTime;

        interpolationScheme cellPoint;

        surfaceFormat vtk;

        // Fields to be sampled
        fields
        (
           p U
        );

        surfaces
        (
            nearWall
            {
                type            patchInternalField;
                patches         ( lowerWall );
                distance        1E-6;
                interpolate     true;
                triangulate     false;
            }
        );
    };


    
     
};



     /////


    
    

// ************************************************************************* //
