wall_resolved_LES/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}

set             c0;

coordinateSystem global;

globalCoeffs
{
    tan1            (1 0 0);
    tan2            (0 1 0);
}

patchLocalCoeffs
{
    patch           outside;
    tan1            (1 0 0);
}

directions      (tan1 tan2);

useHexTopology  no;

geometricCut    yes;

writeMesh       no;

// ************************************************************************* //