wall_resolved_LES/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    buildings
    {
        type triSurfaceMesh;
        file "buildings.stl";
    }

    WERFL
    {
        type triSurfaceMesh;
        file "WERFL.stl";
    }

    refinementBox
    {
        type searchableBox;
        min  (8 0 1.5);
        max  (16 3 5);
    }

    refinementBox2
    {
        type searchableBox;
        min  (12.5 0 2);
        max  (17 1 4);
    }
};

castellatedMeshControls
{
    nCellsBetweenLevels 3;

    features
    (
        { file "buildings.eMesh"; level 2; }
        { file "WERFL.eMesh"; level 3; }
    );

    refinementSurfaces
    {
        buildings
        {
            level (2 2);
            patchInfo { type wall; }
        }

        WERFL
        {
            level (3 3);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 2));
        }

        refinementBox2
        {
            mode inside;
            levels ((1E15 3));
        }
    }

    locationInMesh (8 1 3);
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 40;
    nRelaxIter 15;

    nFeatureSnapIter 20;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    expansionRatio 1.1;
    finalLayerThickness 0.5;
    minThickness 1e-3;

    layers
    {
        buildings
        {
            nSurfaceLayers 5;
        }

        WERFL
        {
            nSurfaceLayers 12;
        }

        ground
        {
            nSurfaceLayers 5;
        }

        frontAndBack
        {
            nSurfaceLayers 5;
        }
    }

    nGrow 0;
    featureAngle 130;
    maxFaceThicknessRatio 0.5;
    nSmoothSurfaceNormals 1;
    nSmoothThickness 10;
    minMedianAxisAngle 90;
    maxThicknessToMedialRatio 0.3;
    nSmoothNormals 3;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 20;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }

    nSmoothScale 4;
    errorReduction 0.75;
}

writeFlags
(
    noRefinement
);

mergeTolerance 1e-6;

// ************************************************************************* //