wall_resolved_LES/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

buildings
{
    surfaces ("buildings.stl");
    #includeEtc "caseDicts/surface/surfaceFeaturesDict.cfg"
}

WERFL
{
    surfaces ("WERFL.stl");
    #includeEtc "caseDicts/surface/surfaceFeaturesDict.cfg"
}

// ************************************************************************* //